---
kind: method
id: M:Autodesk.Revit.DB.RoutingCondition.Dispose
source: html/1734c6d6-a0ea-329f-0570-7f3f71cb542e.htm
---
# Autodesk.Revit.DB.RoutingCondition.Dispose Method

Releases all resources used by the RoutingCondition

## Syntax (C#)
```csharp
public void Dispose()
```